DarcyJProjects/stm32-plc-project/Firmware/Core/Inc/io/io_holding_reg.h
// TODO: I2C support

// HOLDING REGISTERS ARE ANALOGUE OUTPUTS
// R/W as output can be set (W), but last state can be read (R)

#ifndef IO_HOLDING_REG_H
#define IO_HOLDING_REG_H

#include "stm32g4xx_hal.h"

extern uint16_t io_holding_reg_channel_count; // count for all channels or any type, extern so modbus.c can check this
extern uint16_t io_holding_adc_reg_channel_count; // count for only physical dac channels for max channel enforcement


// Only include if enabled in the project config
#ifdef HAL_DAC_MODULE_ENABLED
#include "stm32g4xx_hal_dac.h"
#endif

#include "stm32g4xx_hal_gpio.h"
#include <stdbool.h> // Lets us use boolean logic

// Enumeration to define voltage or current mode (only for physical channels, so default to voltage for all).
typedef enum {
	IO_HOLDING_REG_VOLTAGE,
	IO_HOLDING_REG_CURRENT,
	IO_HOLDING_REG_I2C
} IO_Holding_Reg_Mode;


// Define a struct to represent a holding register channel
typedef struct {
	void (*write_func)(void* context, uint16_t value, IO_Holding_Reg_Mode mode); // Function to write to the particular channel device.
	void* context; // Pointer passed to that function (e.g., DAC channel address, or I2C related handle)
	uint16_t storedValue; // Last output value
	IO_Holding_Reg_Mode mode; // Voltage or current mode (default to voltage)
} IO_Holding_Reg_Channel;

// Struct required for writing physical channel types to EEPROM
typedef struct {
	uint16_t index;
	IO_Holding_Reg_Mode mode;
} IO_Holding_Reg_Type_Record;

#define MAX_IO_HOLDING_REG 32 // max total
#define MAX_IO_HOLDING_REG_PHYSICAL 2

// Adds a new channel to the list
bool io_holding_reg_add_channel(void (*write_func)(void*, uint16_t, IO_Holding_Reg_Mode), void* context, IO_Holding_Reg_Mode mode);


uint16_t io_holding_reg_read(uint16_t index);

void io_holding_reg_write(uint16_t index, uint16_t value);

void io_holding_reg_emergencystop(void);

// Write function for physical adc channels, i2c is device dependent
void dac_write_func(uint32_t channel, uint16_t value, IO_Holding_Reg_Mode mode);

bool io_holding_reg_set_mode(uint16_t index, IO_Holding_Reg_Mode mode);

bool io_holding_reg_get_mode(uint16_t index, IO_Holding_Reg_Mode* mode);

bool io_holding_reg_type_save(uint16_t baseAddress);

bool io_holding_reg_type_clear(bool factoryResetMode);

bool io_holding_reg_type_load(uint16_t baseAddress);

#endif
